tap "nikitabobko/tap"
# Speech synthesizer that supports more than hundred languages and accents
brew "espeak-ng"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Manage multiple Node.js versions
brew "nvm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Terminal multiplexer
brew "tmux"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace", trusted: true
# Terminal-based AI coding assistant
cask "claude-code"
# Image, video and clipboard optimiser
cask "clop"
# Collaborative team software
cask "figma"
# Screenshot and screen recording tool
cask "macshot"
# Control your tools with a few keystrokes
cask "raycast"
# Open source virtual/remote desktop application
cask "rustdesk"
# Team communication and collaboration software
cask "slack"
# SSH client
cask "termius"
# Open-source code editor
cask "visual-studio-code"
vscode "alibaba-cloud-superapp-team.superapp-mini-app-plugin"
vscode "amiralizadeh9480.laravel-extra-intellisense"
vscode "anthropic.claude-code"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "codingyu.laravel-goto-view"
vscode "damms005.devdb"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "flowtype.flow-for-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-complete-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.github-vscode-theme"
vscode "glitchbl.laravel-create-view"
vscode "ihunte.laravel-blade-wrapper"
vscode "jasonnutter.search-node-modules"
vscode "jock.svg"
vscode "jundat95.react-native-snippet"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mgmcdermott.vscode-language-babel"
vscode "miguel-colmenares.css-js-minifier"
vscode "mikestead.dotenv"
vscode "misterj.vue-volar-extention-pack"
vscode "naoray.laravel-goto-components"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "onecentlin.laravel-blade"
vscode "onecentlin.laravel-extension-pack"
vscode "onecentlin.laravel5-snippets"
vscode "pgl.laravel-jump-controller"
vscode "pkief.material-icon-theme"
vscode "pnp.polacode"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "ryannaddy.laravel-artisan"
vscode "shopify.theme-check-vscode"
vscode "shufo.vscode-blade-formatter"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sst-dev.opencode"
vscode "steoates.autoimport"
vscode "streetsidesoftware.code-spell-checker"
vscode "syler.sass-indented"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "yzhang.markdown-all-in-one"
npm "corepack"
npm "yarn"
